# CannotReloadWithFile Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..CannotReloadWithFile Property
BuiltInFailures..::..GroupFailures Class See Also
---
Group [Type Name] cannot be reloaded from file [File Name].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotReloadWithFile { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotReloadWithFile As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotReloadWithFile {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace